Управление_пожарной_частью_/src/Documents/СписаниеВещевогоИмущества/СписаниеВещевогоИмущества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеВещевогоИмущества</name>
  <registerRecords>AccumulationRegister.ВещевоеИмуществоСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВещевоеИмущество</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>EnumRef.РазмерОдежды</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/Documents/СписаниеВещевогоИмущества/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПодобратьИмущество(Команда)
	// Проверяем, что сотрудник выбран
    Если Не ЗначениеЗаполнено(Объект.ФизическоеЛицо) Тогда
        Сообщить("Сначала выберите сотрудника.");
        Возврат;
    КонецЕсли;
	//
	//// Загружаем список имущества сотрудника
	//СписокВыбора = ЗагрузитьИмуществоСотрудникаНаСервере(Объект.ФИОСотрудника);
    
    // Открываем форму выбора
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("ФизическоеЛицо", Объект.ФизическоеЛицо);
	
    ОткрытьФорму("Документ.СписаниеВещевогоИмущества.Форма.ВещевоеИмущество", ПараметрыФормы, ЭтотОбъект,,,,,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, Источник)
    
    Если ВыбранноеЗначение = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Добавляем выбранные позиции
    Для Каждого Строка Из ВыбранноеЗначение Цикл
        НоваяСтрока = Объект.ВещевоеИмущество.Добавить();
        НоваяСтрока.Номенклатура = Строка.Номенклатура;
        НоваяСтрока.Размер = Строка.Размер;
        НоваяСтрока.Количество = Строка.Количество;
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПослеВыбораВещевогоИмущества" Тогда
		
		НоваяСтрока = Объект.ВещевоеИмущество.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметр);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	ТекДанные = Элементы.ВещевоеИмущество.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ВещевоеИмущество.Удалить(ТекДанные);
КонецПроцедуры
